{
  "data": [
    {
      "id": 1,
      "name": "Sarajevo",
	  "lat":43.859,
	  "lng":18.423,
      "image":"http://www.m1key.me/photography/sarajevo/sarajevo_01.jpg",
    "desc": "Sarajevo is the capital and largest city of Bosnia and Herzegovina, with a population of 275,524 in its current administrative limits. Nestled within the greater Sarajevo Valley of Bosnia, it is surrounded by the Dinaric Alps and situated along the Miljacka River in the heart of Southeastern Europe and the Balkans. Sarajevo is the leading political, social and cultural center of Bosnia and Herzegovina, a prominent center of culture in the Balkans, with its region-wide influence in entertainment, media, fashion, and the arts. Due to its long and rich history of religious and cultural diversity, Sarajevo was sometimes called the 'Jerusalem of Europe'."
    },
    {
      "id": 2,
      "name": "Mostar",
	  "lat": 43.343,
	  "lng": 17.807,
      "image":"http://www.thebalkanbackpacker.com/wp-content/uploads/2016/01/mostar-1.jpg",
    "desc": "Mostar is a city and municipality in southern Bosnia and Herzegovina, 135 kilometers southwest of Sarajevo. Inhabited by 105,797 people, it is the most important city in the Herzegovina region, its cultural capital, and the center of the Herzegovina-Neretva Canton of the Federation. Mostar is situated on the Neretva River and is the fifth-largest city in the country. Mostar was named after the bridge keepers (mostari) who in the medieval times guarded the Stari Most (Old Bridge) over the Neretva.The Old Bridge, built by the Ottomans in the 16th century, is one of Bosnia and Herzegovina's most recognizable landmarks, and is considered one of the most exemplary pieces of Islamic architecture in the Balkans."
    },
    {
      "id": 3,
      "name": "Travnik",
	  "lat": 44.226,
	  "lng": 17.656,
    "desc": "Travnik is a town and municipality in central Bosnia and Herzegovina, 90 kilometres west of Sarajevo. It is the capital of the Central Bosnia Canton, and is located in the Travnik Municipality. Travnik town had 16,534 residents in 2013, with a municipality population that of 57,543 people. It was the capital city of the governors of Bosnia from 1699 to 1850, and has a cultural heritage dating from that period. In the Middle Ages the Travnik area was known as the župa Lašva province of the medieval Bosnian Kingdom."

      "image":"https://upload.wikimedia.org/wikipedia/commons/a/a1/Travnik_Panorama_2.JPG"
    },
    {
      "id": 4,
      "name": "Jajce",
	  "lat": 44.340,
	  "lng": 17.271,
    "desc": "Jajce is a town and municipality located in the central part of Bosnia and Herzegovina, in the Bosanska Krajina region, with population of 30.758 people. It is part of the Central Bosnia Canton of the Federation of Bosnia and Herzegovina entity. It is on the crossroads between Banja Luka, Mrkonjić Grad and Donji Vakuf, on the confluence of the rivers Pliva and Vrbas.Jajce was first built in the 14th century and served as the capital of the independent Kingdom of Bosnia during its time."
      "image":"https://www.enjoy.ba/img/tours/9/gallery750x450/002Jajce_waterfall.jpg"
    },
    {
      "id": 5,
      "name": "Zenica",
	  "lat": 44.200,
	  "lng": 17.907,
    "desc": "Zenica is the fourth-largest city in Bosnia and Herzegovina, and the capital of the Zenica-Doboj Canton of the Federation of Bosnia and Herzegovina entity. Zenica is located about 70 km north of Sarajevo and is situated on the Bosna river, surrounded by a mountainous and hilly landscape. The city is home to 115,134 inhabitants as of 2013. Zenica was an important economic and military center during the Banate of Bosnia and the Kingdom of Bosnia, and one of the relics from these eras is the Vranduk fortress. The city's old quarter contains several attractions, including the former synagogue, dating from 1906, which is now part of the City Museum. There is also a mosque, an Austrian fountain and an old bey's farm house (Hadžimazića Kuća)."

      "image":"http://www.visitmycountry.net/bosnia_herzegovina/bh/images/stories/destinacije/fbih/zenica/photos/zenica_01.jpg"
    },
    {
      "id": 6,
      "name": "Bugojno",
	  "lat": 44.055,
	  "lng": 17.449,
    "desc": "Bugojno is a town and municipality in central Bosnia and Herzegovina, situated by the river Vrbas. It is located in the Central Bosnia Canton of the Federation of Bosnia and Herzegovina entity. The town is 130 km to the northwest from Sarajevo. To the west towards Kupres is a region called Koprivica. This enormous forest was once one of President Tito's favorite hunting spots. The uninhabited dense forest has created a sanctuary for wild animals. Hunting associations are very active in this region and there are many mountain and hunting lodges dotting the forest. Duboka Valley (deep valley) is a designated hunting area covered by thick spruce. Kalin Mountain is a popular weekend area for hikers and nature lovers."

      "image":"http://www.avaz.ba/storage/2014/12/04/thumbs/5480473c-bcc0-405e-92ad-0849b0765237-bugojno-preview.jpg"
    },
    {
      "id": 7,
      "name": "Donji Vakuf",
	  "lat": 44.143,
	  "lng": 17.398,
    "desc": "Donji Vakuf is a town and municipality in central Bosnia and Herzegovina, located between Jajce, Bugojno and Travnik. It is under the administration of the Federation of Bosnia and Herzegovina. It was founded by Malkoçoğlu İbrahim Bey in 1572 and was known as 'Aşağı Vakıf' ('Lower foundation' in Turkish). Donji Vakuf is Bosnian translation of 'Aşağı Vakıf'. From 1929 to 1941, Donji Vakuf was part of the Vrbas Banovina of the Kingdom of Yugoslavia."
      "image":"http://www.avaz.ba/storage/2016/03/30/thumbs/56fb850b-3340-4d3b-872f-04da0a0a0a64-1509034-1297738663588935-4641457486260564278-n-718x446.jpg"
    },
    {
      "id": 8,
      "name": "Gornji Vakuf",
	  "lat": 43.937,
	  "lng": 17.587,
    "desc": "Gornji Vakuf-Uskoplje is a town and municipality in central Bosnia and Herzegovina, located between Bugojno, Prozor-Rama, Kupres, Novi Travnik and Konjic. It is under the administration of the Federation of Bosnia and Herzegovina. The name Gornji Vakuf refers to the fact that the town was established as a waqf (Vakuf) by Bosniak nobility. Mehmed-beg Stočanin, a famous Bosniak bey, is the founder of Gornji Vakuf. This town has a typical Bosnian čaršija, which is common in Central Bosnia."

      "image":"http://www.prozor-x.com/wp-content/uploads/2016/04/gornji_vakuf.jpg"
    },
    {
      "id": 9,
      "name": "Bihac",
	  "lat": 44.811,
	  "lng": 15.868,
    "desc": "Bihać is a city on the River Una in northwestern Bosnia and Herzegovina, in the Bosanska Krajina region. It has 56,261 inhabitants. Bihać is located in the Una-Sana Canton (Canton I) of the Federation of Bosnia and Herzegovina. The agricultural sector is significant, due to the large and fertile soil."
      "image":"http://www.raftinguna.com/images/rijeka-una-sadrzaj/rijeka-una-grad-bihac-rafting-una-com.jpg"

    },
    {
      "id": 10,
      "name": "Brcko",
	  "lat": 44.872,
	  "lng": 18.810,
    "desc": "Brčko is a town in northern Bosnia and Herzegovina, administrative seat of the Brčko District. It lies on the Sava river across from Croatia.Its name is very likely linked to the Breuci, an Illyrian tribe inhabiting the area in antiquity."

      "image":"http://balansonline.ba/wp-content/uploads/2015/08/5563.jpg"
    },
    {
      "id": 11,
      "name": "Banja Luka",
	  "lat": 44.771,
	  "lng": 17.190,
    "desc": "Banja Luka is the largest city of the Republika Srpska entity and second largest city in Bosnia and Herzegovina after the capital Sarajevo. Traditionally, it has been the centre of the Bosanska Krajina region, located in the northwestern part of the country. It is home of the University of Banja Luka, as well as numerous state and entity institutions of Bosnia and Herzegovina. The city lies on the River Vrbas and is well known in the countries of the former Yugoslavia for being full of tree-lined avenues, boulevards, gardens, and parks. According to the 2013 census the City of Banja Luka, has 150.997 inhabitants. The name Banja Luka was first mentioned in a document dated 6 February 1494, by Vladislav II. The name is interpreted as 'Ban's meadow', from the words ban ('a medieval dignitary'), and luka ('a valley' or 'a meadow'). The identity of the ban and the meadow in question remain uncertain, and popular etymology combines the modern words banja ('bath' or 'spa'), or bajna ('marvelous') and luka ('port')."

      "image":"http://wikitravel.org/upload/shared//5/57/Banja_Luka_Banner.jpg"
    },
    {
      "id": 12,
      "name": "Visoko",
	  "lat": 43.988,
	  "lng": 18.179,
    "desc": "Visoko is a city and municipality in central Bosnia and Herzegovina of rich historical heritage. It was an early centre of the Bosnian medieval state, and the site where the first Bosnian king Tvrtko I was crowned. Located between Zenica and Sarajevo, Visoko lies on the Bosna river where the river Fojnica merges into it. The municipality is organized into 25 local communities. The municipality is administered by the Zenica-Doboj Canton of the Federation, and it is second largest town in the Canton."

      "image":"http://tuzlanski.ba/wp-content/uploads/2016/06/bosanske-piramide.jpg"
    },
    {
      "id": 13,
      "name": "Prozor",
	  "lat": 43.800,
	  "lng": 17.586,
    "desc": "Prozor-Rama is a municipality in Bosnia and Herzegovina. The town of Prozor is located in the northern part of the Herzegovina-Neretva Canton. There is Ramsko jezero (Rama Lake). In the Middle Ages, the King of Hungary held the title of King of Rama named after this region."

      "image":"https://s-media-cache-ak0.pinimg.com/originals/0d/b7/6e/0db76edecccc6a1e0d50c3fe8f61f589.jpg"
    },
    {
      "id": 14,
      "name": "Bijeljina",
	  "lat": 44.755,
	  "lng": 19.214,
    "desc": "Bijeljina is a city and municipality in northeastern Republic of Srpska (Serb part of Bosnia and Herzegovina). The city is the second largest in the Republika Srpska entity after Banja Luka and the fifth largest city in Bosnia and Herzegovina (after Sarajevo, Banja Luka, Tuzla, and Zenica), and is situated on the plains of Semberija. Bijeljina is the unofficial centre of the eastern part of Republika Srpska, with 114,663 inhabitants. The earliest confirmed traces of human life in the area of today's Bijeljina date from the New Stone Age (5000-3000 BC)."

      "image":"http://www.infobijeljina.com/GalleryImages/27_2473.jpg"
    },
    {
      "id": 15,
      "name": "Bosanska Krupa",
	  "lat": 44.883,
	  "lng": 16.153,
    "desc": "Bosanska Krupa is a town and municipality in northwestern Bosnia and Herzegovina, on the Una river. It is located 30 km northeast from Bihać (350 km away from Sarajevo). It is the seat of a municipality within the Una-Sana Canton of the Federation of Bosnia and Herzegovina."

      "image":"https://www.krupljani.ba/wp-content/uploads/2016/07/Bos_Krupa_1.jpg"
    },
    {
      "id": 16,
      "name": "Medugorje",
	  "lat": 43.200,
	  "lng": 17.662,
    "desc": "Međugorje is a town located in the Herzegovina region of Bosnia and Herzegovina, around 25 km (16 mi) southwest of Mostar and close to the border of Croatia. Since 1981, it has become a popular site of Catholic pilgrimage due to reports of alleged apparitions of the Virgin Mary to six local children. The name Međugorje literally means 'between mountains'."

      "image":"http://antony-boy.com/wp-content/uploads/2016/05/Me%C4%91ugorje2.jpg"
    },
    {
      "id": 17,
      "name": "Sanski Most",
	  "lat": 44.763,
	  "lng": 16.664,
    "desc": "Sanski Most is a city in northwestern Bosnia and Herzegovina. It is located on the Sana River in Bosanska Krajina, between Prijedor and Ključ. Administratively it is part of the Una-Sana Canton of the Federation of Bosnia and Herzegovina. From 1929 to 1941, Sanski Most was part of the Vrbas Banovina of the Kingdom of Yugoslavia."

      "image":"https://i.ytimg.com/vi/02S2ap82lZg/maxresdefault.jpg"
    },
    {
      "id": 18,
      "name": "Breza",
	  "lat": 44.019,
	  "lng": 18.263,
    "desc": "Breza is a town and municipality in central Bosnia and Herzegovina, famous for the local mining activities and production of coal. It covers an area of 73 km² and is part of the Zenica-Doboj Canton in the Federation of Bosnia and Herzegovina. Total area of municipality of Breza is 83 square kilometers. It is located in the Zenica-Doboj Canton and it borders with four municipalities: Ilijaš, Kakanj, Vareš and Visoko. Its economic environment is based on coalmine, which was established in year 1907."

      "image":"http://www.visitmycountry.net/bosnia_herzegovina/bh/images/stories/destinacije/fbih/breza/breza_001.jpg"
    },
    {
      "id": 19,
      "name": "Busovaca",
	  "lat": 44.098,
	  "lng": 17.879,
    "desc": "Busovača is a small town and municipality in Bosnia and Herzegovina. It is 60 km from Sarajevo, 21 km (13 mi) from Zenica, and 30 km from Travnik."

      "image":"http://www.mgpsbk-ksb.com.ba/pvodic/img/busovaca.jpg"
    },
    {
      "id": 20,
      "name": "Buzim",
	  "lat": 45.052,
	  "lng": 16.056,
    "desc": "Bužim is a municipality situated in the most northwestern Bosnia and Herzegovina. Administratively, it is part of the Una-Sana Canton. The total land area of Bužim is about 129 km2 (50 sq mi) with a population of 20,000."

      "image":"http://static.panoramio.com/photos/original/79527826.jpg"
    },
    {
      "id": 21,
      "name": "Capljina",
	  "lat": 43.111,
	  "lng": 17.697,
    "desc": "Čapljina  is a town and municipality in Bosnia and Herzegovina. It is located in the Herzegovina-Neretva Canton of the Federation of Bosnia and Herzegovina. Čapljina is located on the border with Croatia a mere 20 kilometres (12 mi) from the Adriatic Sea. The river Neretva flows through the municipality and flows into the Adriatic just over the border. The town's landmark is a statue of King Tomislav. The Church of Saint Francis of Assisi is also a prominent facet of the town. The municipal coat of arms contains the Croatian chequy, the nearby tower in Počitelj, and Saint Francis of Assisi. The municipality has a rich archaeological history and untouched wilderness and is starting to develop agricultural tourism. It is also home to Hutovo Blato Park, which contains one of the most diverse bird populations in all Europe."

      "image":"http://upload.wikimedia.org/wikipedia/commons/5/58/%C4%8Capljina.JPG"
    },
    {
      "id": 22,
      "name": "Citluk",
	  "lat": 43.226,
	  "lng": 17.698,
    "desc": "Čitluk (Latin: Aequum) is a town and municipality located in Herzegovina, in southern Bosnia and Herzegovina. It is a municipality of the Herzegovina-Neretva Canton in the Federation of Bosnia and Herzegovina.The rich soil in this area is used for growing wine-producing grapes. Many varieties grown in Brotnjo are popular throughout the world (e.g., Blatina)."

      "image":"http://www.visitmycountry.net/bosnia_herzegovina/bh/images/stories/destinacije/fbih/citluk/citluk_001.jpg"
    },
    {
      "id": 23,
      "name": "Doboj",
	  "lat": 44.745,
	  "lng": 18.087,
    "desc": "Doboj is a city and municipality in the northern region of the Republika Srpska entity in Bosnia and Herzegovina, on the river Bosna. Doboj is the largest national railway junction Railways Corporation of Bosnia and Herzegovina are located in Doboj. It is one of the oldest cities in the country and the most important urban center in northern Republika Srpska.Doboj was continuously inhabited ever since Neolithic times. Fragments of pottery and decorative art were found on several localities, with the most known site in Makljenovac, south from the city proper, at the confluence of rivers Usora and Bosna. In fact, archeological findings from paleolithic era were found in the cave at this very site - Vila suburb."

      "image":"http://static.panoramio.com/photos/large/15847372.jpg"}
    },
    {
      "id": 24,
      "name": "Foca",
	  "lat": 43.506,
	  "lng": 18.780,
    "desc": "Foča is a town and a municipality in Bosnia and Herzegovina on the Drina river, in the Republika Srpska entity. The town was known as Hotča during medieval times."

      "image":"http://www.visitmycountry.net/bosnia_herzegovina/bh/images/stories/destinacije/rs/visegrad/visegrad.jpg"
    },
    {
      "id": 25,
      "name": "Fojnica",
	  "lat": 43.963,
	  "lng": 17.899,
    "desc": "Fojnica is a town and municipality in central Bosnia and Herzegovina, located west of the capital Sarajevo. It lies in the valley of the Fojnička River, tributary of the river Bosna. Administratively, Fojnica is part of the Central Bosnia Canton of the Federation of Bosnia and Herzegovina. Fojnica is a balneological resort. Cultural sites in Fojnica include the Holy Spirit Franciscan Monastery which houses an important part of the nation's cultural heritage, maintained by the Franciscan Province of Bosna Srebrena.The Franciscan monastery in Fojnica has a library of philosophical and theological works printed from the 16th to the 19th centuries, with some dating back to 1481."

      "image":"http://bosniandream.com/storage/app/media/katalog/fojnica2.jpg"
    },
    {
      "id": 26,
      "name": "Gradacac",
	  "lat": 44.879,
	  "lng": 18.426,
    "desc": "Gradačac is a town and municipality in the northeastern part of Bosnia and Herzegovina, located roughly 40 km south of the Sava river. Administratively, Gradačac is part of the Tuzla Canton of the Federation of Bosnia and Herzegovina. The city is well known for its castle."

      "image":"http://gradacac.org/wp-content/uploads/2015/03/22.jpg"
    },
    {
      "id": 27,
      "name": "Gorazde",
	  "lat": 43.669,
	  "lng": 18.974,
    "desc": "Goražde is a city in eastern Bosnia and Herzegovina on the Drina river. It is located between Foča, Rogatica and Višegrad, and is administratively part of the Federation of Bosnia and Herzegovina and the center of the Bosnian Podrinje Canton. The surrounding region of Goražde is composed of Paleozoic slate, sandstone, carbon and perm. The hills are for the most part rounded and with gentle slopes. The higher ones are composed of limestone."

      "image":"http://s9.postimage.org/l89oxr3fz/Gorazde3.jpg"
    },
    {
      "id": 28,
      "name": "Jablanica",
	  "lat": 43.656,
	  "lng": 17.758,
    "desc": "Jablanica is a town and municipality of the same name in central Bosnia and Herzegovina. The town is situated on the Neretva river and Jablanica lake. Jablanica is a part of the Herzegovina-Neretva Canton. The municipality of Jablanica is a major tourist destination in Bosnia and Herzegovina. The municipality offer a wide variety of activities. The surrounding mountains such as Plasa, Čvrsnica and Prenj offer both hunting grounds and a variety of hiking trails. One popular hiking destination is 'Hajdučka Vrata', a natural wonder, the product of wind erosion, located 2,000 meters above sea level on the mountain of Čvrsnica. The Jablanica Lake (Jablaničko Jezero) is a very important resource. The lake borders many of its settlements and is used for several purposes. The lake is used to generate electricity while it also serves as a top summer destination for fishing, swimming, water sports and other activities."

      "image":"http://www.devimtours.com/img/photo-gallery/Jablanicka/o/tito-partizan-war.jpg"
    },
    {
      "id": 29,
      "name": "Kakanj",
	  "lat": 44.129,
	  "lng": 18.118,
    "desc": "Kakanj is an industrial town and a municipality in central Bosnia and Herzegovina, located north of Visoko and southeast of Zenica. It was built along the slopes of wide hills on either side of the Zgošća river. It is administratively part of the Zenica-Doboj Canton of the Federation of Bosnia and Herzegovina. Neolithic artifacts have been found in Obre, a nearby village."

      "image":"http://moteltiron.com/wp-content/uploads/2016/06/kakanj_noc.jpg"
    },
    {
      "id": 30,
      "name": "Kiseljak",
	  "lat": 43.943,
	  "lng": 18.076,
    "desc": "Kiseljak is a small town and municipality in central Bosnia and Herzegovina, located northwest of Sarajevo and south of Zenica. Kiseljak lies in the valley of the Fojnica River, the Lepenica and the Kreševka River, which are a tributary of the Bosna, and it is on the intersection of roads from Visoko, Fojnica, Kreševo and Rakovica. It is administratively part of the Central Bosnia Canton of the Federation of Bosnia and Herzegovina."

      "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Panorama_Kiseljaka09211.JPG/800px-Panorama_Kiseljaka09211.JPG"
    },
    {
      "id": 31,
      "name": "Kljuc",
	  "lat": 44.535,
	  "lng": 16.774,
    "desc": "Ključ is a town and municipality by the same name in western Bosnia and Herzegovina. It is located in the Federation of Bosnia and Herzegovina, specifically the Una-Sana Canton. The name of the town and the municipality translates to 'Key' in Bosnian. Human settlements have existed in the area long before the Roman Era. The town itself is first mentioned in 1322 in the documents of ban Stjepan II Kotromanić. It was conquered by the Ottoman Empire in 1463 as the last Royal Bosnian fortress. Kljuc was first mentioned in 1322. In 1463, during the Ottoman invasion of Bosnia, the last Bosnian king Stjepan Tomašević, took refuge in the city. His surrender and execution marked the downfall of the medieval Bosnian state."

      "image":"http://sana.ba/media/k2/items/cache/4ab4b6df96c060fa741e97b50eafb07c_XL.jpg"
    },
    {
      "id": 32,
      "name": "Konjic",
	  "lat": 43.650,
	  "lng": 17.964,
    "desc": "Konjic is a town and municipality in Bosnia and Herzegovina. It is located in northern Herzegovina, around 50 kilometres (31 mi) southwest of Sarajevo. It is a mountainous, heavily wooded area, and is 268 m (879 ft) above sea level. The municipality extends on both sides of the Neretva River. The city is one of the oldest permanent settlements in Bosnia, dating back almost 4000 years; the city in its current incarnation arising as an important town in the late 14th century. Today, the population of Konjic municipality is estimated at 26,000 people. The area near the town is believed to be settled up to 4000 years ago, and settlements around 2000 years ago by Illyrian tribes travelling upstream along the Neretva river have been found."

      "image":"http://farm4.staticflickr.com/3756/9321172596_3859ba40c7_b.jpg"
    },
    {
      "id": 33,
      "name": "Cazin",
	  "lat": 44.966,
	  "lng": 15.941,
    "desc": "Cazin is a city and municipality in northwest Bosnia and Herzegovina in the Bosanska Krajina region, near the border with Croatia. It is located in the Una-Sana Canton of the Federation of Bosnia and Herzegovina. The municipality is often also called Cazinska Krajina. The town of Cazin is located on the main road which connects Bihać and Velika Kladuša. Cazin has several historic places, some dating back to the 14th century. Ostrožac castle and Radetina Tower are located in Cazin."

      "image":"https://cdn.flii.by/image/ram0l6l86b0.jpg"
    },
    {
      "id": 34,
      "name": "Livno",
	  "lat": 43.823,
	  "lng": 17.007,
    "desc": "Livno is a city and municipality in the west of Bosnia and Herzegovina. It is part of Canton 10 of the Federation of Bosnia and Herzegovina. Situated on the river Bistrica in the southeastern edge of the Livno Field at the foot of Krug mountain and rocky hill Crvenice, it is the centre of the Canton 10 which mainly covers an area of the historical and geographical region of Tropolje. The town, with the remains of the antique architecture and the old town from the 9th century, first mentioned in 892, developed at the crossroads of roads between the Adriatic coast and inland, i.e., regions of Bosnia, Dalmatia, Herzegovina and Krajina."

      "image":"http://static.panoramio.com/photos/large/38699626.jpg"
    },
    {
      "id": 35,
      "name": "Lukavac",
	  "lat": 44.533,
	  "lng": 18.532,
    "desc": "Lukavac is a town and municipality in northeastern Bosnia and Herzegovina. The town is the seat of a municipality within the Tuzla Canton of the Federation of Bosnia and Herzegovina. Lukavac has strong chemical industry, like the whole Tuzla region. The main factories are Soda Lukavac, member of Turkish Şişecam group and cement factory Fabrika Cementa Lukavac (FCL)."

      "image":"https://upload.wikimedia.org/wikipedia/bs/6/66/Lukavacc.jpg"
    },
    {
      "id": 36,
      "name": "Ljubuski",
	  "lat": 43.195,
	  "lng": 17.548,
    "desc": "Ljubuški is a town and municipality in Bosnia and Herzegovina. It is located in the West Herzegovina Canton, a unit of the Federation of Bosnia and Herzegovina. The town was first time mentioned in 1444. The name Ljubuški originates from an ancient Slavic name Libusa who used to be the first wife of the then ruler of Herzegovina Herzeg Stjepan."

      "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/LjubuskiPanorama_A.jpg/1200px-LjubuskiPanorama_A.jpg"
    },
    {
      "id": 37,
      "name": "Maglaj",
	  "lat": 44.544,
	  "lng": 18.097,
    "desc": "Maglaj is a town and municipality in northern Bosnia and Herzegovina. Maglaj is one of 12 municipalities of the Zenica-Doboj Canton. The city lies 25 km (16 mi) south of Doboj, the regional trade, education, culture, entertainment, and business centre. The city has a population of 25,000. The whole municipality has a population of 43,000."

      "image":"http://divithana.com/wp-content/uploads/2014/06/75081_484376554942482_1928817990_n-660x330.jpg"
    },
    {
      "id": 38,
      "name": "Mrkonjic Grad",
	  "lat": 44.417,
	  "lng": 17.085,
    "desc": "Mrkonjić Grad (Serbian Cyrillic: Мркоњић Град; pronounced [mr̩koɲit͡ɕ grad]) is a town and municipality in western Bosnia and Herzegovina, in the Republika Srpska entity. It is located in the Bosanska Krajina, between Banja Luka and Jajce. The town changed its name several times in history: Gornje Kloke, Novo Jajce, Varcarev Vakuf, Varcar Vakuf, and ultimately the present one. The last renaming took place in 1924 after King Peter I of Serbia, who had taken the nom de guerre 'Mrkonjić' while fighting in the uprising (1875–78) against the Ottoman Empire."

      "image":"http://www.mrkonjic-grad.rs/sajt/doc/image/galeri_sr/52_gal.jpg"
    },
    {
      "id": 39,
      "name": "Novi Travnik",
	  "lat": 44.173,
	  "lng": 17.661,
    "desc": "Novi Travnik is a town and municipality in Bosnia and Herzegovina. It is located in the Central Bosnia Canton in the Federation of Bosnia and Herzegovina. The municipality was called Novi Travnik until 1980, when it was styled Pucarevo after Đuro Pucar. In 1992 the original name was restored. Novi Travnik was founded in 1949 to provide residence for the employees of the newly founded MMK Bratstvo factory, and so it is one of the youngest settlements in the region. As of January 2015, the municipality contains nine National Monuments of Bosnia and Herzegovina,[1] among which are seven stećak necropolises, one mosque and the Necropolis for the victims of Fascism."

      "image":"http://www.novitravnik.ba/wp-content/uploads/2016/06/Novi-Travnik.jpg"
    },
    {
      "id": 40,
      "name": "Neum",
	  "lat": 42.923,
	  "lng": 17.620,
    "desc": "Neum is the only town to be situated along Bosnia and Herzegovina's 20 km (12 mi) of coastline,[3] making it the country's only access to the Adriatic Sea. In 2009 the municipal (općina) population was 4,605 and in 1991 the population of Neum town was 4,268."

      "image":"http://static.abcmagazin.info/Slike/590x363/neum1110.jpg"
    },
    {
      "id": 41,
      "name": "Olovo",
	  "lat": 44.126,
	  "lng": 18.580,
    "desc": "Olovo is a town and municipality situated about 50 kilometers northeast of Sarajevo, Bosnia and Herzegovina. The town Olovo was first mentioned in the year 1382 under the name 'Plumbum'(Latin for lead). The word olovo in Bosnian means lead, which is meant to characterize the city for its well-known lead ore deposits. Olovo stands on the Sarajevo-Tuzla highway M18, and is located 50 km northeast of Bosnia and Herzegovina's capital city of Sarajevo. Olovo is a part of the Zenica-Doboj Canton. Since the Middle Age there have been well-known lead ore deposits, and was at that time considered a mining town."

      "image":"http://www.medjugorje-info.com/images/_SLIKE_VIJESTI/gospa-olovska-svetiste.jpg"
    },
    {
      "id": 42,
      "name": "Orasje",
	  "lat": 45.028,
	  "lng": 18.695,
    "desc": "Orašje is a town and municipality in the northern part of Bosnia and Herzegovina, located on the river Sava on the border with Croatia. Orašje is the center of the Posavina Canton of the Federation of Bosnia and Herzegovina. It lies across the Sava river from Županja in Croatia."

      "image":"http://www.orasje.ba/images/stories/Slideshow/4.jpg"
    },
    {
      "id": 43,
      "name": "Prijedor",
	  "lat": 44.980,
	  "lng": 16.703,
    "desc": "Prijedor is a city and municipality is a part of the Republika Srpska entity in Bosnia and Herzegovina with an estimated population of 97,588 people within its administrative limits. Prijedor is situated in the Bosanska Krajina region. Prijedor is the third largest municipality in the Republika Srpska entity, after Banja Luka and Bijeljina, and the seventh largest in Bosnia and Herzegovina. It is an economically prosperous municipality hosting a wide range of industries, services and educational institutions. The city's geographical location close to major European capitals has made it an important industrial and commercial hub nationally. Prijedor is known for its Catholic, Orthodox Christian and Islamic heritage. Historic buildings from the Ottoman and Austrian-Hungarian periods are a feature of the urban landscape. The city underwent extensive renovation between 2006–2009."

      "image":"http://bosnapress.net/wp-content/uploads/2015/08/prijedor-624x336.jpg"
    },
    {
      "id": 44,
      "name": "Rogatica",
	  "lat": 43.799,
	  "lng": 19.003,
    "desc": "Rogatica is a municipality and town in eastern Bosnia and Herzegovina located 60 kilometres northeast of Sarajevo; midway on the road from Goražde towards Sokolac. Rogatica and the town of Žepa are located in the Rogatica municipality in the Republika Srpska entity of Bosnia and Herzegovina."

      "image":"http://rogaticani.com/wp-content/uploads/2014/05/panorama2.jpg"
    },
    {
      "id": 45,
      "name": "Srebrenica",
	  "lat": 44.102,
	  "lng": 19.297,
    "desc": "Srebrenica is a town in the easternmost Republika Srpska, Bosnia and Herzegovina. Srebrenica is a small mountain town, its main industry being salt mining and a nearby spa. During the Bosnian War, the town was the site of a July 1995 massacre of the town's Bosniak population, determined to have been a war crime."

      "image":"https://s-media-cache-ak0.pinimg.com/736x/c8/d5/7c/c8d57caa97bf339f244f40c201af8ebe.jpg"
    },
    {
      "id": 46,
      "name": "Srebrenik",
	  "lat": 44.706,
	  "lng": 18.493,
    "desc": "Srebrenik is a town and municipality in northeastern Bosnia and Herzegovina. It is administratively part of the Tuzla Canton and the Federation of Bosnia and Herzegovina. The town of Srebrenik is located northwest of Tuzla, the country's third largest city. Bosnia's best-preserved medieval castle dating from 1333 is located in the outskirts of Srebrenik. The castle was occupied by the Ban of Bosnia Stjepan Kotromanić until his death in 1353. There are two historical versions related to the Ottoman conquest of Srebrenik. According to one, Srebrenik was taken in 1512, together with Teočak. The other version says that Srebrenik was taken together with Sokol and Tešanj in 1521 by the Bosnian sanjak bey Feriz. Although there is no precise data, it can be assumed that the Srebrenik old town and its fortress were built during the Hungarian rule over Bosnia, while some parts, such as a mosque were built during the Ottoman period."

      "image":"https://lh3.googleusercontent.com/-2n6iySWyHLg/VoGz75y_wyI/AAAAAAAAZLg/49rlmuj4uPI/s680-Ic42/1.jpg"
    },
    {
      "id": 47,
      "name": "Stolac",
	  "lat": 43.083,
	  "lng": 17.956,
    "desc": "Stolac is a town and municipality in Bosnia and Herzegovina, located in Herzegovina. Administratively, it is part of the Herzegovina-Neretva Canton in the Federation of Bosnia and Herzegovina. Stolac is situated in the area known as Herzegovina Humina, on the tourist route crossing Herzegovina and linking the Bosnian mountainous hinterland with the coastal regions of Bosnia and Herzegovina, Dubrovnik and Montenegro. The road, running from Sarajevo via Mostar, Stolac, Ljubinje and Trebinje, enables one to reach Dubrovnik in less than 4 hours. Thanks to the town's favourable natural environment - geological composition, contours, climate, hydrographic and vegetation - Stolac and its area have been settled since ancient times. Its rich hunting-grounds along with other natural benefits attracted prehistoric man, and later the Illyrians, Romans and Slavs, all of whom left a wealth of anthropological evidence."

      "image":"http://www.herzegdaytours.com/wp-content/uploads/2016/02/IMG_6007741301837.jpeg"
    },
    {
      "id": 48,
      "name": "Sipovo",
	  "lat": 44.285,
	  "lng": 17.089,
    "desc": "Šipovo is a town and municipality in central Bosnia and Herzegovina. It is situated in the western part of the Republika Srpska entity and the southern part of the Bosanska Krajina region. The municipality covers an area of 510 km2 (197 sq mi), much of which is forested."

      "image":"http://bh-itinerary.com/en/images/bt_property/154/large-1438119971-sipovo1.jpg"
    },
    {
      "id": 49,
      "name": "Siroki Brijeg",
	  "lat": 43.382,
	  "lng": 17.593,
    "desc": "Široki Brijeg is a city in Bosnia and Herzegovina. It is located in the West Herzegovina Canton, a unit of the Federation of Bosnia and Herzegovina. It is one of the twelve official cities of Bosnia and Herzegovina. The name of the city means 'wide hill'. It is sometimes referred to as Široki Brig or simply Široki ('wide'). Between 1945 and 1990, the town was officially called Lištica, after the river that flows through it."

      "image":"https://farm7.staticflickr.com/6195/6075937815_822a2c004d_b.jpg"
    },
    {
      "id": 50,
      "name": "Tesanj",
	  "lat": 44.615,
	  "lng": 17.990,
    "desc": "Tešanj is a town and municipality in the northern part of Bosnia and Herzegovina, located near Teslić, Doboj and Zavidovići. Administratively, it belongs to the Zenica-Doboj Canton of the Federation of Bosnia and Herzegovina. The present name of the city was mentioned for the first time in 1461 in a charter from King Stephen Tomašević to his uncle Radivoj. The charter stated that King Stephen Tomašević grants him, among other possessions 'i na Usori grad Tešanj -- the city of Tešanj, in the Usora region'."

      "image":"http://tesanj.net/wp-content/uploads/2014/06/10380125_722140354515061_7538996992212646031_o.jpg"
    },
    {
      "id": 51,
      "name": "Tomislavgrad",
	  "lat": 43.719,
	  "lng": 17.228,
    "desc": "Tomislavgrad, also known by its former name Duvno, is a town and municipality in western Bosnia and Herzegovina and also seat of the Assembly of Canton 10 of the Federation of Bosnia and Herzegovina. The city name means literally 'Tomislav town'. The name was changed from Županjac to Tomislavgrad in 1928 by King Alexander I in tribute to his son Prince Tomislav and also Tomislav, the first king of the Kingdom of Croatia, who was crowned in the area."

      "image":"http://hms.ba/wp-content/uploads/2016/06/franjeva%C4%8Dki-samostan-tomislavgrad.jpg"
    },
    {
      "id": 52,
      "name": "Tuzla",
	  "lat": 44.537,
	  "lng": 18.668,
    "desc": "Tuzla is a city in Bosnia and Herzegovina. It is the seat of the Tuzla Canton and is the economic, scientific, cultural, educational, health and tourist centre of northeast Bosnia. After Sarajevo and Banja Luka, Tuzla is the third largest city in Bosnia and Herzegovina. Preliminary results from the 2013 Census indicate that the municipality has a population of 120,441. Tuzla is an educational center and is home to two universities. It is also the main industrial machine and one of the leading economic strongholds of Bosnia with a wide and varied industrial sector including an expanding service sector thanks to its salt lake tourism. The city of Tuzla is home to Europe's only salt lake as part of its central park and has more than 100,000 people visiting its shores every year. The history of the city goes back to the 9th century; modern Tuzla dates back to 1510 when it became an important garrison town in the Ottoman Empire. In Bosnia and Herzegovina, Tuzla is also regarded as one of the most multicultural cities in the country and has managed to keep the pluralist character of the city throughout the Bosnian War and after, with Bosniaks, Serbs, Croats and a small minority of Bosnian Jews residing in Tuzla."

      "image":"http://www.come-enjoy-bosnia.com/data/02_tuzla.JPG"
    },
    {
      "id": 53,
      "name": "Trebinje",
	  "lat": 42.712,
	  "lng": 18.348,
    "desc": "Trebinje is the southernmost municipality and city in Bosnia and Herzegovina. Located in East Herzegovina, it is part of the Republika Srpska entity, and its population numbers 31,433 (2013). The Trebišnjica river flows through the heart of the city. The city's old town quarter dates to the 18th-century Ottoman period, and includes the Arslanagić Bridge."

      "image":"http://81.93.84.110/wp-content/uploads/2016/05/Trebinje-2.jpg"
    },
    {
      "id": 54,
      "name": "Usora",
	  "lat": 44.697,
	  "lng": 17.974,
    "desc": "Usora is a rural municipality in the Federation of Bosnia and Herzegovina with a Bosnian Croat majority. It borders with Doboj and Tešanj municipality,and it is named after the Usora River. It was created by succession from Tešanj and Doboj municipality's, during last Yugoslavian war."

      "image":"http://static.panoramio.com/photos/original/98291463.jpg"
    },
    {
      "id": 55,
      "name": "Vares",
	  "lat": 44.161,
	  "lng": 18.325,
    "desc": "Vareš is a town and municipality in central Bosnia and Herzegovina, famous for the local mining activities and production of iron. It is part of the Zenica-Doboj Canton and the Federation of Bosnia and Herzegovina. The town of Vareš has a long history with remains of metallurgical activities dating back to Bronze Age. Also during the Roman era, the town was famous for its miners and smiths. During Middle Ages the Bosnian kings had their center in close proximity of the modern city of Vareš. Bosnia's greatest king, Tvrtko, considered the Vareš' village Duboštica for the center of his kingdom, since it was the mining center of his country."

      "image":"http://bhvision.com/wp-content/uploads/2015/08/bobovac-cover.jpg"
    },
    {
      "id": 56,
      "name": "Velika Kladusa",
	  "lat": 45.184,
	  "lng": 15.806,
    "desc": "Velika Kladuša is a town and municipality in the far northwest of Bosnia and Herzegovina, located near the border with Croatia. The closest city is Cazin, and a bit farther, the cities of Bihać and Bosanski Novi. Across the border, it is not far from Cetingrad. Administratively, it is part of the Una-Sana Canton of the Federation of Bosnia and Herzegovina. Velika Kladuša was first mentioned by name on October 30, 1280 (date on its shield) by the name Cladosa. During the era of Byzantine Empire it is assumed that the population of the town started to slowly grow. Towards the end of the 13th century up to 1464, Velika Kladuša was controlled by two different Hungarian kings."

      "image":"http://www.phone-travel.com/fajlovi/idea/users/stari-grad-velika-kladusa-stari-grad-kladusa-1_51b07beeee9bf.jpg"
    },
    {
      "id": 57,
      "name": "Visegrad",
	  "lat": 43.783,
	  "lng": 19.293,
    "desc": "Višegrad is a town in eastern Bosnia and Herzegovina resting at the confluence of the Drina and the Rzav river, in the synonymous municipality in Republika Srpska entity. The town includes the Ottoman-era Mehmed Paša Sokolović Bridge, a UNESCO world heritage site which was popularized by Nobel prize-winning author Ivo Andrić in his novel The Bridge on the Drina. A tourist site called Andrić Grad (Andrić's Town), dedicated to Andrić, is located near the bridge. Višegrad is a South Slavic toponym meaning 'the upper town/castle/fort'."

      "image":"http://sarajevobosniatours.ba/wp-content/uploads/Visegrad.jpg"
    },
    {
      "id": 58,
      "name": "Vitez",
	  "lat": 44.151,
	  "lng": 17.790,
    "desc": "Vitez is a town and municipality in central Bosnia and Herzegovina. It is administratively part of the Central Bosnia Canton of the Federation of Bosnia and Herzegovina. The word 'vitez' literally means knight in the South Slavic languages, Bosnian; Croatian; Slovenian; Serbian and Macedonian, it is also used in Hungarian. The Russian cognate is Vityaz."

      "image":"http://www.dnevnik.ba/sites/default/files/novosti-slike/17493753.jpg"
    },
    {
      "id": 59,
      "name": "Zavidovici",
	  "lat": 44.443,
	  "lng": 18.142,
    "desc": "Zavidovići is a town and municipality in central Bosnia and Herzegovina, located between Doboj and Zenica on the confluence of rivers Bosna, Krivaja and Gostović. It sits in a valley surrounded by many mountains of which the largest is Klek. It is administratively part of the Zenica-Doboj Canton of the Federation of Bosnia and Herzegovina. Zavidovići was developed by the Austrians during the 19th century Austro-Hungarian reign in Bosnia, mostly because of the 'wood industry'."

      "image":"http://www.direktno.ba/wp-content/uploads/2016/04/kugla-650x433.jpg"
    },
    {
      "id": 60,
      "name": "Zvornik",
	  "lat": 44.386,
	  "lng": 19.100,
    "desc": "Zvornik is a city on the Drina river in north-eastern, Bosnia and Herzegovina. Zvornik is located south of Bijeljina. The town Mali Zvornik ('Little Zvornik') lies directly across the river in Serbia. Zvornik is first mentioned in 1410, although it was known as Zvonik ('bell tower') at that time."

      "image":"https://c1.staticflickr.com/3/2872/9362250015_290a71fa4c_b.jpg"
    },
    {
      "id": 61,
      "name": "Zepce",
	  "lat": 44.429,
	  "lng": 18.038,
    "desc": "Žepče is a town and municipality in central Bosnia and Herzegovina, located between Doboj and Zenica. It is administratively part of the Zenica-Doboj Canton of the Federation of Bosnia and Herzegovina.Near by the town and within the town, there are 14 springs of mineral water. Žepče is in the valley and surrounded by mountains. The town was first mentioned in 1458 in a charter issued by the Bosnian king Stjepan Tomašević ('... Pissanna Žepču va ljetu 1458. oktombrija 14. dan.' (Written in Žepče in the year 1458. 14.day of October))."

      "image":"http://bh-itinerary.com/images/bt_property/55/original-1458143991-Op%C4%87ina%20%C5%BDep%C4%8De.jpg"
    },
    {
      "id": 62,
      "name": "Zivinice",
	  "lat": 44.445,
	  "lng": 18.650,
    "desc": "Živinice is a town and municipality in northeastern Bosnia and Herzegovina, located south of Tuzla. It is part of the Tuzla Canton of the Federation of Bosnia and Herzegovina. The origin of the name Živinice is still not established. According to M. Hadžijanić Živinice was mentioned in a Turkish document of 1764 as Živinice called Uskopči, probably (Oskovci) in nahija Tuzla."

      "image":"http://photos.wikimapia.org/p/00/02/04/21/25_big.jpg"
    }
  ]
}
